#include <iostream>
using namespace std;

void task_if10(); //оголошення методу завдання if10
void task_geom31(); // оголошення методу завдання geom31

int main()
{
    int menu; // оголошення змінної з якого користувач обере яке саме завдання він хоче переглянути

    cout << "Task number: "; // просимо користувача обрати
    cin >> menu; // доємо можливість обрати
    
    switch (menu) // перевірка що саме користувач обрав?
    {
        case 1: task_if10(); break; // перше завдання
        case 2: task_geom31(); break; // друге завдання
        default: cout << "Wrong task (only 1 or 2)" << endl; // якщо користувач ввів інше
    }

    // закінчення програми
    system("pause");
    return 0;
}

void task_if10() // прописуємо метод if10
{
    int a; // оголошуємо змінні
    int b;

    cout << "Enter intagares:" << endl; // просимо користувача присвоїти змінним цифри/числа

    cin >> a; // користувач вводе
    cin >> b;

    if (a && b) // якщо змінні є цілими
        if (a != b) // якщо змінні не дорівнюють один одному
            cout << "A: " << a << endl << "B: " << b << endl; // виводимо результат
        else // якщо рівні
        {
            a = 0; // то програма присвоює їм нуль
            b = 0;

            cout << "A and B: 0" << endl; // показуємо користувачу що змінні нульові
        }
    else // якщо не цілі
        cout << "Wrong Integer" << endl; // говоримо користувочу що змінні не цілі
}

void task_geom31() // прописуємо метод geom31
{
    int x; // оголошуємо змінні координат точки
    int y;

    int r; // оголошуємо радіус окружності фігури

    cout << "Enter x and y your point, and radius:" << endl; // просимо ввести користувача які саме у нього координати точки та радіус його фігури
    cin >> x >> y >> r; // даємо можливість користувачу присвоїти змінним потрібні числа/змінні

    if ((x >= 0) && (y >= 0) && (x*x + y*y <= r*r) && (y <= -x + r)) // якщо точка входить у цю фігуру
        cout << "the point belongs to the area" << endl; // говоримо користовачу що його точка у фігурі
    else // якщо не входе
        cout << "the point isn't belongs to the area" << endl; // говоримо користувачу що його точка не входу у фігуру
}